bench/trimbench/res.amd2/o.test.out
Create /data/m/f.1 at Mon Jun 17 04:41:37 PM UTC 2024
524288+0 records in
524288+0 records out
549755813888 bytes (550 GB, 512 GiB) copied, 2756.27 s, 199 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 512G Jun 17 17:27 /data/m/f.1
Sleep for 30 seconds after creating /data/m/f.1 at Mon Jun 17 05:27:34 PM UTC 2024
stat: cannot statx '/data/m/f.2': No such file or directory
run.sh: line 27: [: -lt: unary operator expected
Existing /data/m/f.2 is large enough
Create /data/m/f.2 then sleep for 30 seconds at Mon Jun 17 05:28:04 PM UTC 2024
32768+0 records in
32768+0 records out
34359738368 bytes (34 GB, 32 GiB) copied, 172.131 s, 200 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 32G Jun 17 17:30 /data/m/f.2
List mount options for filesystems
sysfs on /sys type sysfs (rw,nosuid,nodev,noexec,relatime)
proc on /proc type proc (rw,nosuid,nodev,noexec,relatime)
udev on /dev type devtmpfs (rw,nosuid,relatime,size=7828084k,nr_inodes=1957021,mode=755,inode64)
devpts on /dev/pts type devpts (rw,nosuid,noexec,relatime,gid=5,mode=620,ptmxmode=000)
tmpfs on /run type tmpfs (rw,nosuid,nodev,noexec,relatime,size=1577212k,mode=755,inode64)
/dev/sda2 on / type ext4 (rw,relatime)
securityfs on /sys/kernel/security type securityfs (rw,nosuid,nodev,noexec,relatime)
tmpfs on /dev/shm type tmpfs (rw,nosuid,nodev,inode64)
tmpfs on /run/lock type tmpfs (rw,nosuid,nodev,noexec,relatime,size=5120k,inode64)
cgroup2 on /sys/fs/cgroup type cgroup2 (rw,nosuid,nodev,noexec,relatime,nsdelegate,memory_recursiveprot)
pstore on /sys/fs/pstore type pstore (rw,nosuid,nodev,noexec,relatime)
efivarfs on /sys/firmware/efi/efivars type efivarfs (rw,nosuid,nodev,noexec,relatime)
bpf on /sys/fs/bpf type bpf (rw,nosuid,nodev,noexec,relatime,mode=700)
systemd-1 on /proc/sys/fs/binfmt_misc type autofs (rw,relatime,fd=29,pgrp=1,timeout=0,minproto=5,maxproto=5,direct,pipe_ino=24427)
mqueue on /dev/mqueue type mqueue (rw,nosuid,nodev,noexec,relatime)
hugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,pagesize=2M)
debugfs on /sys/kernel/debug type debugfs (rw,nosuid,nodev,noexec,relatime)
tracefs on /sys/kernel/tracing type tracefs (rw,nosuid,nodev,noexec,relatime)
fusectl on /sys/fs/fuse/connections type fusectl (rw,nosuid,nodev,noexec,relatime)
configfs on /sys/kernel/config type configfs (rw,nosuid,nodev,noexec,relatime)
none on /run/credentials/systemd-sysusers.service type ramfs (ro,nosuid,nodev,noexec,relatime,mode=700)
/dev/sda1 on /boot/efi type vfat (rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=iso8859-1,shortname=mixed,errors=remount-ro)
binfmt_misc on /proc/sys/fs/binfmt_misc type binfmt_misc (rw,nosuid,nodev,noexec,relatime)
tmpfs on /run/snapd/ns type tmpfs (rw,nosuid,nodev,noexec,relatime,size=1577212k,mode=755,inode64)
tmpfs on /run/user/1000 type tmpfs (rw,nosuid,nodev,relatime,size=1577208k,nr_inodes=394302,mode=700,uid=1000,gid=1000,inode64)
/dev/nvme0n1 on /data type xfs (rw,noatime,nodiratime,attr2,discard,inode64,logbufs=8,logbsize=32k,noquota)
/var/lib/snapd/snaps/lxd_27948.snap on /snap/lxd/27948 type squashfs (ro,nodev,relatime,errors=continue,x-gdu.hide)
/var/lib/snapd/snaps/core20_2264.snap on /snap/core20/2264 type squashfs (ro,nodev,relatime,errors=continue,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21465.snap on /snap/snapd/21465 type squashfs (ro,nodev,relatime,errors=continue,x-gdu.hide)
/var/lib/snapd/snaps/lxd_28373.snap on /snap/lxd/28373 type squashfs (ro,nodev,relatime,errors=continue,x-gdu.hide)
nsfs on /run/snapd/ns/lxd.mnt type nsfs (rw)
/var/lib/snapd/snaps/core20_2318.snap on /snap/core20/2318 type squashfs (ro,nodev,relatime,errors=continue,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21759.snap on /snap/snapd/21759 type squashfs (ro,nodev,relatime,errors=continue,x-gdu.hide)

Remove /data/m/f.1 at Mon Jun 17 05:31:26 PM UTC 2024
Start fio to read from /data/m/f.2 at Mon Jun 17 05:31:26 PM UTC 2024

iops-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

iops-test-job: (groupid=0, jobs=1): err= 0: pid=1026887: Mon Jun 17 17:32:57 2024
  read: IOPS=101k, BW=396MiB/s (415MB/s)(34.8GiB/90001msec)
    slat (usec): min=3, max=285, avg= 4.26, stdev= 1.62
    clat (usec): min=16, max=19047, avg=71.66, stdev=86.92
     lat (usec): min=22, max=19099, avg=76.08, stdev=86.98
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   48], 10.00th=[   50], 20.00th=[   55],
     | 30.00th=[   60], 40.00th=[   63], 50.00th=[   66], 60.00th=[   70],
     | 70.00th=[   74], 80.00th=[   78], 90.00th=[   84], 95.00th=[   91],
     | 99.00th=[  127], 99.50th=[  227], 99.90th=[ 1434], 99.95th=[ 1614],
     | 99.99th=[ 2737]
   bw (  KiB/s): min=31512, max=456344, per=100.00%, avg=414830.95, stdev=101363.58, samples=175
   iops        : min= 7878, max=114086, avg=103707.81, stdev=25340.92, samples=175
  lat (usec)   : 20=0.01%, 50=12.07%, 100=85.10%, 250=2.35%, 500=0.11%
  lat (usec)   : 750=0.03%, 1000=0.05%
  lat (msec)   : 2=0.25%, 4=0.03%, 10=0.01%, 20=0.01%
  cpu          : usr=18.85%, sys=55.57%, ctx=2126080, majf=1, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9124737,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=396MiB/s (415MB/s), 396MiB/s-396MiB/s (415MB/s-415MB/s), io=34.8GiB (37.4GB), run=90001-90001msec

Disk stats (read/write):
  nvme0n1: ios=9113128/11, merge=0/5, ticks=588615/13, in_queue=589888, util=97.43%

run.sh: line 58: kill: (1026875) - No such process
Linux amd2 5.15.0-101-generic #111-Ubuntu SMP Tue Mar 5 20:16:58 UTC 2024 x86_64 x86_64 x86_64 GNU/Linux